ИТ_Фирма/src/DataProcessors/ЗагрузкаПрайслистаКонтрагента/ЗагрузкаПрайслистаКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаПрайслистаКонтрагента</name>
  <attributes>
    <name>Конрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ИТ_Фирма/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныПродажиНоменклатуры</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИТ_Фирма/src/DataProcessors/ЗагрузкаПрайслистаКонтрагента/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ВыбратьФайлАсинхронно();
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура ВыбратьФайлАсинхронно(); 

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл для загрузки данных";
	Диалог.Фильтр = "CSV-файлы|*.csv";
	
	РезультатВыбора = Ждать Диалог.ВыбратьАсинх();
	
	Если РезультатВыбора = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.ПутьКФайлу = РезультатВыбора[0];
	
	
КонецПроцедуры	

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	ЗагрузитьФайлАсинхронно();
КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗагрузитьФайлАсинхронно()
	
	Доступность = СогласоватьЦены;
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,Объект.ПутьКФайлу,УникальныйИдентификатор);
	РезультатЗагрузки = ЗагрузитьФайлНаСервер(ОписаниеФайла.Адрес, УникальныйИдентификатор);
	
	ОтветыНаВопрос = Новый СписокЗначений;
	ОтветыНаВопрос.Добавить(1,"Не создавать документ");
	ОтветыНаВопрос.Добавить(2,"Не загружать цены");
	ОтветыНаВопрос.Добавить(3,"Создавать номенклатуру");
	
	Если Не РезультатЗагрузки.ВсяНоменклатураНайдена Тогда
		ТекстВопроса = "Не все позиции существуют в справочнике. Продолжить создание докумена?";
		ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса,ОтветыНаВопрос);
		Если ОтветПользователя = 1 Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	СоздатьДокумент(Объект.Конрагент, РезультатЗагрузки.АдресДанныхФайла, Доступность, ОтветПользователя);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗагрузитьФайлНаСервер(АдресФайлаВоВременномХранилище, УникальныйИдентификатор)

	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("csv");
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	
	РезультатЗагрузки = Новый Структура("ВсяНоменклатураНайдена, АдресДанныхФайла", Истина, Неопределено);
	ПрочитатьФайл(ИмяВременногоФайла, РезультатЗагрузки, УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяВременногоФайла);
	УдалитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	
	Возврат РезультатЗагрузки;
	
КонецФункции	

	
&НаСервереБезКонтекста
Процедура ПрочитатьФайл(ИмяВременногоФайла, РезультатЗагрузки, УникальныйИдентификатор)


	ТекстовыйФайлЗагрузки = Новый ТекстовыйДокумент;
	ТекстовыйФайлЗагрузки.Прочитать(ИмяВременногоФайла,КодировкаТекста.UTF8);
	Результат = Новый Массив;
	ШаблонСообщения = НСтр("ru = 'Номенклатура: %1 не найдена'");
	
	Для НомерСтроки = 1 по ТекстовыйФайлЗагрузки.КоличествоСтрок() Цикл
		
		НоваяСтрока = ТекстовыйФайлЗагрузки.ПолучитьСтроку(НомерСтроки);
		
		Позиция = Найти(НоваяСтрока, ";");
		
		НаименованиеНоменклатуры = Сред(НоваяСтрока, 1, Позиция - 1);
		Цена = Сред(НоваяСтрока, Позиция + 1);
		
		ДанныеСтрокиДокумента = Новый Структура;
		ДанныеСтрокиДокумента.Вставить("НаименованиеНоменклатуры", НаименованиеНоменклатуры);
		ДанныеСтрокиДокумента.Вставить("Цена", Цена);
		
		 Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ДанныеСтрокиДокумента.НаименованиеНоменклатуры);
		 
		 Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ШаблонСообщения,ДанныеСтрокиДокумента.НаименованиеНоменклатуры);
			Сообщение.Сообщить();
			
			РезультатЗагрузки.ВсяНоменклатураНайдена = Ложь;
		КонецЕсли;
		
		ДанныеСтрокиДокумента.Вставить("НоменклатураСсылка", Номенклатура);
		
		Результат.Добавить(ДанныеСтрокиДокумента);
	КонецЦикла;	
	
	РезультатЗагрузки.АдресДанныхФайла = ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДокумент(Конрагент, АдресДанныхФайла, Доступность, ОтветПользователя)	
	
	ДокументЦены = Документы.УстановкаЦен.СоздатьДокумент();
	ДокументЦены.Дата = ТекущаяДата();
	ДокументЦены.Контрагент = Конрагент;
	ДокументЦены.Комментарий = "Загружен из файла";
		
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресДанныхФайла);
	
	Для Каждого ДанныеСтроки Из ДанныеФайла Цикл
		
		Номенклатура = ДанныеСтроки.НоменклатураСсылка;	
		
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			
			Если ОтветПользователя = 3 Тогда 
				
				НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
				НоваяНоменклатура.Наименование = ДанныеСтроки.НаименованиеНоменклатуры;
				НоваяНоменклатура.Записать();
				Номенклатура = НоваяНоменклатура.Ссылка;
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;	
			
		КонецЕсли;	
		Если ОтветПользователя = 2 Тогда
			
			НоваяСтрокаТЧ = ДокументЦены.Цены.Добавить();
			НоваяСтрокаТЧ.Номенклатура = Номенклатура ;
			НоваяСтрокаТЧ.Цена = "";
			Продолжить;
			
		КонецЕсли;		
		
		НоваяСтрокаТЧ = ДокументЦены.Цены.Добавить();
		
		НоваяСтрокаТЧ.Номенклатура = Номенклатура;
		
		НоваяСтрокаТЧ.Цена = ДанныеСтроки.Цена;
		
		
		
	КонецЦикла;	
	
	Если Доступность = Истина Тогда 
		
		ДокументЦены.Записать(РежимЗаписиДокумента.Проведение);
		ДокументЦены.Согласовано = Истина;
		
	Иначе 
		
		ДокументЦены.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(АдресДанныхФайла);
	
КонецПроцедуры
